[
  {
    "id": 1,
    "category": "webDevelopment",
    "subCategory": "frontend",
    "img": "https://johnsmilga.com/_next/image?url=https%3A%2F%2Fimages2.imgbox.com%2Ffe%2Fd6%2FPfBtcErG_o.png&w=1920&q=100",
    "title": "html & css mastery",
    "miniDesc": "Web Development for absolute beginners.Learn HTML5 and CSS3 from scratch by building 20+ amazing real world projects.Node.js from scratch. Learn JavaScript runtime by building your own API. During the course we also cover Express and MongoDB.",
    "duration": "8 hours",
    "ratings": "5.0",
    "fullDescription": "If you want to start your career in Web Development, HTML and CSS are essential skills to have because they are foundational languages of the web.HTML stands for Hyper Text Markup Language. In short HTML is a markup language that is used developing web pages.CSS stands for Cascading Style Sheets. In short CSS is a language responsible for layout and styling of the web pages.In this course we will cover both languages from the scratch and by the end of the course become HTML and CSS ninjas by building Responsive Real World Projects.Why you should take this course?Reason Number ONE - You Will Understand the Web Better.Knowing the HTML and CSS and how they are used to create web pages is essential for web developer as they are building blocks of every web page.Reason Number TWO - You Will be able to Create Websites.Once you will know HTML and CSS you will be able to create a personal,unique web page for yourself.Reason Number THREE - Start a Web Career.For anybody who wants to pursue a career in Web Development knowledge of HTML and CSS is required. Reason Number FOUR - You Will Progress to Another Programming Languages with Greater Ease.Once you know the fundamentals of HTML and CSS you will be able to pick up languages like Javascript with greater ease."
  },
  {
    "id": 2,
    "category": "webDevelopment",
    "subCategory": "fullstack",
    "img": "https://johnsmilga.com/_next/image?url=https%3A%2F%2Fimages2.imgbox.com%2Fc5%2Fad%2FVNwsjJYb_o.png&w=1920&q=100",
    "title": "react for beginners",
    "miniDesc": "React from scratch. Learn the most popular UI library and build 25+ Interesting Projects. During the course we also cover Redux Toolkit.Node.js from scratch. Learn JavaScript runtime by building your own API. During the course we also cover Express and MongoDB.",
    "duration": "18 hours",
    "ratings": "5.0",
    "fullDescription": "React is a JavaScript library for building user interfaces. It is developed and maintained by Facebook, and is often used for building single-page applications and mobile applications.One reason to learn React is that it is a popular and in-demand technology, so learning it can improve your job prospects and make it easier to find work as a front-end developer. React is also a good choice for building modern web applications because it is efficient, scalable, and fast, and it uses a virtual DOM (a lightweight in-memory representation of the actual DOM) to minimize the number of DOM manipulations required, which makes it easier to build high-performance applications.Another reason to learn React is that it is a well-designed and flexible library that makes it easy to build reusable components that can be composed to build complex user interfaces. This makes it easier to maintain and update your codebase over time, as you can reuse components in multiple places rather than having to rewrite the same code multiple times.Overall, React is a powerful and widely used tool for building modern web applications, and learning it can be a valuable addition to your skillset as a front-end developer."
  },
  {
    "id": 3,
    "category": "webDevelopment",
    "subCategory": "backend",
    "img": "https://johnsmilga.com/_next/image?url=https%3A%2F%2Fimages2.imgbox.com%2F8a%2Fed%2FLzmoqPEx_o.png&w=1920&q=100",
    "title": "serverless functions for beginners",
    "miniDesc": "Learn serverless functions with Netlify and discover a world of possibilities for running on-demand, server-side code without having toNode.js from scratch. Learn JavaScript runtime by building your own API. During the course we also cover Express and MongoDB.",
    "duration": "10 hours",
    "ratings": "4.0",
    "fullDescription": "I guess let's start by answering the most pressing question first. What is a serverless function and why should we care? So, here is the deal. There are times when our app needs a dynamic feature and even after that 20th google search, we inevitably come to realization that the only way do it, is by building and hosting our own server. A good example would be setting up a stripe payment flow. There is a better solution though.Serverless Functions.Ok, but what is a serverless function? Well, despite the name, serverless function actually does not mean that there is no server. What it simply means, is that someone else is responsible for maintaining it . We, as front-end developers only need to setup our desired functionality, and the cloud provider will take care of the rest. What also really cool, we can continue to use our favorite programming language – Javascript. Most cloud providers offer some solution of serverless functions but for this course we will hosting company by the name of Netlify. We will use Netlify because they offer generous free tier and make it very easy,  to get up and running with serverless functions."
  },
  {
    "id": 4,
    "category": "webDevelopment",
    "subCategory": "frontend",
    "img": "https://johnsmilga.com/_next/image?url=https%3A%2F%2Fimages2.imgbox.com%2F8d%2F44%2Fm5ICZQsi_o.png&w=1920&q=100",
    "title": "gatsby for beginners",
    "miniDesc": "Gatsby.js from scratch. Learn React-based, GraphQL powered, static site generator and build four cool projects.Node.js from scratch. Learn JavaScript runtime by building your own API. During the course we also cover Express and MongoDB.",
    "duration": "16 hours",
    "ratings": "4.5",
    "fullDescription": "Gatsby is a React-based, GraphQL powered static site generator. It combines together the best parts of React, webpack, react-router, GraphQL, and other front end tools to provide excellent developer experience. Gatsby is far more than typical static site generator though. You can think of it more like a modern front-end  framework.It uses powerful pre-configuration to build a website that uses only static files for incredibly fast page loads, service workers, code splitting, server side rendering, smart image loading, asset optimization, and data prefetching."
  },
  {
    "id": 5,
    "category": "webDevelopment",
    "subCategory": "backend",
    "img": "https://johnsmilga.com/_next/image?url=https%3A%2F%2Fimages2.imgbox.com%2Fb4%2Fdc%2FCM4dusXj_o.png&w=1920&q=100",
    "title": "node js for beginners",
    "miniDesc": "Node.js from scratch. Learn JavaScript runtime by building your own API. During the course we also cover Express and MongoDB.",
    "duration": "12 hours",
    "ratings": "5.0",
    "fullDescription": "I guess let's start by answering the most pressing question first. What is a NodeJS? And even though there are plenty of good answers out there the one that I like the most is this one - 'NodeJS is an environment to run Javascript outside of the Browser'. NodeJS was created in 2009 and it's built on top of Chrome's V8 Javascript Engine. As you are probably aware of, every browser has an engine, a tool that compiles our code down to machine code and Chrome uses one by the name of V8. Since the moment it was created, Node has evolved tremendously, and while there are many things to like about Node, some of the main ones are - large community, since that tremendously saves time on feature development, as well as the fact that with the help of Node, it's never been easier to build Full-Stack Apps, since both Front-End And Back-End are built in one language, and you guessed that language is our beloved Javascript."
  },
  {
    "id": 6,
    "category": "webDevelopment",
    "subCategory": "frontend",
    "img": "https://johnsmilga.com/_next/image?url=https%3A%2F%2Fimages2.imgbox.com%2F2a%2F4f%2FP1loAQCI_o.png&w=1920&q=100",
    "title": "styled components for beginners",
    "miniDesc": "Styled Components. Learn popular library that is used to style react applications.Node.js from scratch. Learn JavaScript runtime by building your own API. During the course we also cover Express and MongoDB.",
    "duration": "4 hours",
    "ratings": "4.9",
    "fullDescription": "Styled Components are part of CSS inJS movement where we can create components that possess their own encapsulated styles. No longer we need to create component decide on a selector and then rush to app css or any other stylesheet to write separate styles for that particular component. What makes Styled Components so cool is their awesome tagged template syntax that allows to create normal react components by only defining styles. With zero configuration styled-components support css modularity, variables in css, nesting in css, extending components styles and many more. Styled Components also allows us to  write plain CSS in your components without worrying about class name collisions"
  },
  {
    "id": 7,
    "category": "webDevelopment",
    "subCategory": "fullstack",
    "img": "https://images2.imgbox.com/42/2d/XfIDxiBV_o.png",
    "title": "mern stack course for beginners",
    "miniDesc": "MERN Stack. Build Full Stack Application from Scratch with MongoDB, Express, React and NodeJS.Node.js from scratch. Learn JavaScript runtime by building your own API. During the course we also cover Express and MongoDB.",
    "duration": "20 hours",
    "ratings": "4.6",
    "fullDescription": "What's up everybody, this is John from Coding Addict and welcome to my MERN Stack course . During the course we will build full stack application (Jobify) from scratch, using MongoDB, Express, React and Node.js, Create a front-end application from scratch (React),  Add normalize.css and global styles to React Application, Build bunch of nice looking pages (Landing, Error, Register, Dashboard, etc), Setup nice looking images,  Setup routing using React Router 6, Create a global context using createContext and utilize useContext hook, Setup a global state using useReducer hook, Create global Alert component, Create server application from scratch , Use ES6 Modules on the back-end, Implement 'nodemon' package "
  },
  {
    "id": 8,
    "category": "appDevelopment",
    "subCategory": "backend",
    "img": "https://static-00.iconduck.com/assets.00/kotlin-icon-512x512-0o0lfw0b.png",
    "title": "Kotlin course for beginners",
    "miniDesc": "Write better Android apps faster with Kotlin. Kotlin is a modern statically typed programming language used by over 60% of professional Android developers that helps boost productivity, developer satisfaction, and code safety.",
    "duration": "20 hours",
    "ratings": "4.6",
    "fullDescription": "Kotlin is a cross-platform, statically typed, general-purpose high-level programming language with type inference. Kotlin is designed to interoperate fully with Java, and the JVM version of Kotlin's standard library depends on the Java Class Library, but type inference allows its syntax to be more concise. Kotlin is an open-source, statistically typed programming language that's designed to work on almost any platform, principally Android, JVM, JavaScript and Native. Inspired by Java, its USP is its simplicity and safety."
  },
  {
    "id": 9,
    "category": "appDevelopment",
    "subCategory": "backend",
    "img": "https://cdn-icons-png.flaticon.com/512/121/121152.png",
    "title": "JAVA stack course for beginners",
    "miniDesc": "Java is a widely-used programming language for coding web applications. It has been a popular choice among developers for over two decades, with millions of Java applications in use today.",
    "duration": "20 hours",
    "ratings": "4.6",
    "fullDescription": "Java has been around for a long time, so many learning resources are available for new programmers. Detailed documentation, comprehensive books, and courses support developers through the learning curve. In addition, beginners can start writing code in Core Java before moving to Advanced Java. Java has many active users and a community that can support developers when they face coding challenges. The Java platform software is also maintained and updated regularly. Java offers various tools to support automated editing, debugging, testing, deployment, and change management. These tools make Java programming time and cost-efficient."
  }
]
